app/helpers/sessions_helper.rb

SELECT  `users`.* FROM `users` WHERE `users`.`id` = 3 LIMIT 1
---
  def current_user
    @current_user ||= User.find_by(id: session[:user_id]) if session[:user_id]

SELECT  `users`.* FROM `users` WHERE `users`.`id` = 3 LIMIT 1
---
  def current_user?(_user)
    @current_user = User.find_by(id: session[:user_id]) if @current_user.nil?