app/controllers/microposts_controller.rb

SELECT `microposts`.* FROM `microposts`
---
  def index
    @microposts = Micropost.all

INSERT INTO `microposts` (`content`, `user_id`, `created_at`, `updated_at`) VALUES ('hello', 1, '2019-04-25 05:23:55', '2019-04-25 05:23:55')
---
  def create
    @micropost = current_user.microposts.build(micropost_params)
    if @micropost.save

UPDATE `microposts` SET `user_id` = 2, `updated_at` = '2019-04-25 05:24:44' WHERE `microposts`.`id` = 2
---
  def update
    respond_to do |format|
      if @micropost.update(micropost_params)

SELECT  `microposts`.* FROM `microposts` WHERE `microposts`.`id` = 1 LIMIT 1
---
  def set_micropost
    @micropost = Micropost.find(params[:id])