app/controllers/relationships_controller.rb

  def create
    user = User.find(params[:followed_id])
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 2 LIMIT 1

  def destroy
    user = Relationship.find(params[:id]).followed
---
SELECT  `relationships`.* FROM `relationships` WHERE `relationships`.`id` = 1 LIMIT 1