app/controllers/sessions_controller.rb

SELECT  `users`.* FROM `users` WHERE `users`.`email` = 'test@aa.com' LIMIT 1
---
  def create
    user = User.find_by(email: params[:session][:email].downcase)