app/controllers/static_pages_controller.rb

  def home
    if logged_in?
      @micropost = current_user.microposts.build

      # binding.pry

      @feed_items = current_user.feed.paginate(page: params[:page])
---
SELECT COUNT(*) FROM `microposts` WHERE (user_id IN (SELECT followed_id FROM relationships
SELECT  `microposts`.* FROM `microposts` WHERE (user_id = 3) LIMIT 30 OFFSET 0