app/controllers/users_controller.rb

SELECT `users`.* FROM `users`
SELECT  `users`.* FROM `users` LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM `users`
---
  def index
    @users = User.all
    @users = User.paginate(page: params[:page])

SELECT  `users`.* FROM `users` WHERE `users`.`id` = 2 LIMIT 1
SELECT  `microposts`.* FROM `microposts` WHERE `microposts`.`user_id` = 1 LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM `microposts` WHERE `microposts`.`user_id` = 1
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1  [["id", 1], ["LIMIT", 1]]
---
  def show
    @user = User.find(params[:id])
    @microposts = @user.microposts.paginate(page: params[:page])

INSERT INTO `users` (`name`, `email`, `created_at`, `updated_at`) VALUES ('kanako', 'test@aa.com', '2019-05-08 05:05:16', '2019-05-08 05:05:16')
---
  def create
    @user = User.new(user_params)
    if @user.save

SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1  [["id", 1], ["LIMIT", 1]]
UPDATE `users` SET `email` = 'test1@aa.com', `updated_at` = '2019-05-08 10:00:05' WHERE `users`.`id` = 1
---
  def update
    @user = User.find(params[:id])
    if @user.update(user_params)

SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @user = User.find(params[:id])

SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 3 LIMIT 1
---
  def following
    @title = 'Following'
    @user  = User.find(params[:id])
    @users = @user.following.paginate(page: params[:page])

SELECT  `users`.* FROM `users` WHERE `users`.`id` = 3 LIMIT 1
---
  def followers
    @title = 'Followers'
    @user  = User.find(params[:id])
    @users = @user.followers.paginate(page: params[:page])

SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
---
  def correct_user
    @user = User.find(params[:id])